#ifndef SMS_H
	#define SMS_H

	#include <stdlib.h>
	#include <stdint.h>
	#include <stdarg.h>

	#define PRESS_START	0x1000
	#define PRESS_B		0x0200
	#define PRESS_A		0x0100
	#define PRESS_Z		0x0010
	#define PRESS_X		0x0400
	#define PRESS_Y		0x0800
	#define PRESS_DU	0x0008
	#define PRESS_DD	0x0004
	#define PRESS_DL	0x0001
	#define PRESS_DR	0x0002
	#define PRESS_L		0x0040
	#define PRESS_R		0x0020

	#define MARIOFLAG_ALIVE						0x00000001
	#define MARIOFLAG_INVISIBLE					0x00000004
	#define MARIOFLAG_ALLDEAD					0x00000F00
	#define MARIOFLAG_GAMEOVER					0x00000400
	#define MARIOFLAG_SLIP						0x00000080
	#define MARIOFLAG_HASHELMET_FOLLOWCAMERA	0x00001000
	#define MARIOFLAG_HASHELMET					0x00002000
	#define MARIOFLAG_HASFLUDD					0x00008000
	#define MARIOFLAG_SPLASH					0x00010000
	#define MARIOFLAG_PUDDLE					0x00020000
	#define MARIOFLAG_SHIRT						0x00100000
	#define MARIOFLAG_GONE						0x00200000
	
	#define STATE_NUMBER	0x0000000F
	#define STATE_AIRBORN	0x00000800
	#define STATE_DOJUMP	0x00000080
	#define STATE_AIRBORN	0x00000800
	#define STATE_CUTSCENE	0x00001000
	#define STATE_STUNNED	0x00002000
	
	#define STATE_RUNNING	0x04000440
	#define STATE_IDLE		0x0C400201
	#define STATE_STOP		0x0C00023D
	#define STATE_SPIN		0x00000441
	#define STATE_JUMPSPIN	0x00000890
	#define STATE_JUMPSPIN1	0x00000895
	#define STATE_JUMPSPIN2	0x00000896
	#define STATE_JUMP		0x02000880
	#define STATE_D_JUMP	0x02000881

	#define STATE_KNCK_GND  0x00020466 // Front knockback while grounded
	#define STATE_FIRE_HIT	0x000208B7
	#define STATE_FIRE_RVR	0x08000239 // Recover from fire on ground
	#define STATE_HOVER_F	0x0000088D // Falling from hover
	#define STATE_SLIDE_R1	0x000008A6 // Recover from slide by flipping
	#define STATE_SLIDE_R2 	0x00000386 // Recover from slide by getting up
	#define STATE_R_SPRAY	0x0C008220 // Recover from spray
	#define STATE_G_POUND	0x008008A9 // Ground pounding
	
	//#define
	
	#define BGM_DOLPIC          0x80010001
	#define BGM_BIANCO          0x80010002
	#define BGM_MAMMA           0x80010003
	#define BGM_PINNAPACO_SEA   0x80010004
	#define BGM_PINNAPACO       0x80010005
	#define BGM_MARE_SEA        0x80010006
	#define BGM_MONTEVILLAGE    0x80010007
	#define BGM_SHILENA         0x80010008
	#define BGM_RICCO           0x80010009
	#define BGM_GET_SHINE       0x8001000A
	#define BGM_CHUBOSS         0x8001000B
	#define BGM_MISS            0x8001000C
	#define BGM_BOSS            0x8001000D
	#define BGM_MAP_SELECT      0x8001000E
	#define BGM_BOSSPAKU_DEMO   0x8001000F
	#define BGM_MAIN_TITLE      0x80010010
	#define BGM_CHUBOSS2        0x80010011
	#define BGM_EXTRA           0x80010012
	#define BGM_DELFINO         0x80010013
	#define BGM_MAREVILLAGE     0x80010014
	#define BGM_CORONA          0x80010015
	#define BGM_KAGEMARIO       0x80010016
	#define BGM_CAMERA          0x80010017
	#define BGM_MONTE_ONSEN     0x80010018
	#define BGM_MECHAKUPPA      0x80010019
	#define BGM_AIRPORT         0x8001001A
	#define BGM_UNDERGROUND     0x8001001B
	#define BGM_TITLEBACK       0x8001001C
	#define BGM_MONTE_NIGHT     0x8001001D
	#define BGM_CASINO          0x8001001E
	#define BGM_EVENT           0x8001001F
	#define BGM_TIME_IVENT      0x80010020
	#define BGM_SKY_AND_SEA     0x80010021
	#define BGM_MONTE_RESCUE    0x80010022
	#define BGM_MERRY_GO_ROUND  0x80010023
	#define BGM_SCENARIO_SELECT 0x80010024
	#define BGM_FANFARE_CASINO  0x80010025
	#define BGM_FANFARE_RACE    0x80010026
	#define BGM_CAMERA_KAGE     0x80010027
	#define BGM_GAMEOVER        0x80010028
	#define BGM_BOSSHANA_2ND3RD 0x80010029
	#define BGM_BOSSGESO_2DN3RD 0x8001002A
	#define BGM_CHUBOSS_MANTA   0x8001002B
	#define BGM_MONTE_LAST      0x8001002C
	#define BGM_SHINE_APPEAR    0x8001002D
	#define BGM_KUPPA           0x8001002E
	#define BGM_SPACEWORLD		0x80011030
	
	#define SND_PIPE			9598
	
	//#define GFX_OFF				0x09A4 - E3
	#define GFX_OFF				0x07F4
	
	#define AIRPORT		0
	#define DOLPIC0		1
	#define	BIANCO0		2
	#define RICCO0		3
	#define MAMMA0		4
	#define PINNABEACH0	5
	#define SIRENA0		6
	#define DELFINO0	7
	#define	MONTE0		8
	#define MARE0		9
	#define NONE0		10
	#define SCALE0		11
	#define TEST10		12
	#define PINNAPARCO0	13
	#define CASINO0		14
	
	#define GFX_OFF     0x09A4
	

typedef float Mtx[3][4];
typedef float Mtx44[4][4];

enum GXProjectionType
{
	GX_PERSPECTIVE = 0,
	GX_ORTHOGRAPHIC = 1
};

typedef struct
{

	float x, y, z;

} Vec, *VecPtr, Point3d, *Point3dPtr;

typedef	struct	{
    Point3d	position;
    Point3d	target;
    Vec		up;
    float	fovy;
    float	znear;
    float	zfar;
    Mtx		viewMtx;
    Mtx44	projMtx;
}   Camera;

typedef	struct {
    int		xorg;
    int		yorg;
    int		width;
    int		height;
}   ViewPort;

typedef struct{
	int u1;
} WaterGun;

typedef struct{
	uint16_t buttons; // 0x0
	int8_t lanalogx; // 0x4
	int8_t lanalogy; // 0x8
	int8_t ranalogx; // 0xC
	int8_t ranalogy; // 0xA
	uint8_t ltrig; // 0xE
	uint8_t rtrig; // 0x12
	uint8_t status; //0x16
	uint8_t u2;
	uint8_t u3;
	uint8_t u4;
} __attribute__((packed)) Controller;

typedef struct{
	void* type;
	void* u1[55];
	int u2;
	int u3[7];
} MarioGamePad;

// MarDirector* mardirector = (MarDirector*)(r13 + 0x9FB8)
typedef struct{
	int u1;
} MarDirector;

typedef struct{
	float x;
	float y;
	float z;
} Vector;

typedef struct {
	int flag1;
	int flag2;
	int flag3;
	int flag4;
	int flag5;
	int flag6;
	int flag7;
	int flag8;
	int flag9;
	int flag10;
} NormalSoundData;

typedef struct {
	float u1;
	float u2;
	float u3;
	float u4;
} HitTable;

typedef struct{
	char* colKey;
	int flag;
} ColData;

typedef struct AnimData_t{
	char* modelKey;
	int unk1;
	int unk2;
	int unk3;
	int unk4;
	int unk5;
	int unk6;
	int unk7;
	int unk8;
	int unk9;
	char* animModel;
	char* animKey;
	int unk10;
	int unk11;
	int unk12;
} AnimData;

typedef struct {
	int info1;
	AnimData* aData;
} AnimInfo;

typedef struct {
	int flag1;
	int flag2;
	int flag3;
	HitTable* hitData;
} HitInfo;

typedef struct {
	int flag1;
	ColData* cData;
} ColInfo;

typedef struct {
	int flag1;
	NormalSoundData* normSoundData; // okay what?
} SoundInfo;

typedef struct ObjectData_t {
	char* modelKey;
	float unknown1;
	char* shiftJis;
	char* shiftJis2;
	AnimInfo* aInfo;
	HitInfo* hInfo;
	ColInfo* cInfo;
	SoundInfo* sInfo;
	int unused1;
	int unused2;
	int unused3;
	int unused4;
	float unknown2;
	int flag1;
	int flag2;
} ObjectData;

struct HitActor_t;
struct EMario_t;
struct EnemyMario_t;
struct WaterGun_t;
struct Yoshi_t;
struct ObjectData_t;
struct AnimData_t;

typedef struct PolarSubCamera_t {
	void* Type;
	void* u2;
	int u3;
	int u4;
	Vector position;
	int u5;
	void* u6;
	int u7;
	Vector u8;
	float u9;
	int u10;
	Vector rotation;
	Vector u11;
	int u12[51];
	MarioGamePad* gamepad;
} PolarSubCamera;

typedef struct MapObjBase_t{
	void* Type;			//0
	void* u2;
	int u3;
	int u4;	
	Vector position;	//10
	int u5;
	void* u6;			//20
	Vector scale;
} __attribute__((packed)) MapObjBase;

typedef struct HitActor_t{
	void* Type;			//0
	void* u2;
	int u3;
	int u4;	
	Vector position;	//10
	int u5;
	void* u6;			//20
	Vector scale;
	Vector direction;	//30
	void* u7;
	void* u8;			//40
	struct HitActor_t** colarray;
	uint16_t colcount;
	uint16_t colarraysize;
	int colsettings;
	float bound1;			//50
	float bound2;
	float bound3;
	float bound4;
	float bound5;			//60
	int colflags;
	int u18;
	int u19;
	void* u20;			//70
	void* u21[0x2F];
	ObjectData* objData; // 130
} __attribute__((packed)) HitActor;

typedef struct {
	void* Type;			//0
	void* u2;
	int u3;
	int u4;	
	Vector position;	//10
	int u5;
	void* u6;			//20
	Vector scale;
	Vector direction;	//30
	void* u7;
	void* u8;			//40
	struct HitActor_t** colarray;
	uint16_t colcount;
	uint16_t colarraysize;
	int colsettings;
	float bound1;			//50
	float bound2;
	float bound3;
	float bound4;
	float bound5;			//60
	int colflags;
	int u18;
	int u19;
	void* u20;			//70
	void* u21;			//74
	void* u22;			//78
	int snd1;			//7C
	int snd2;			//80
	char* bas;			//84
	int status;			//88
	int init;			//8c
	int status_timer;	//90
	int temp6;			//94
	int temp7;			//98
	int temp8;			//9c
	int temp9;			//a0
	int temp10;			//a4
	int temp11;			//a8
	int temp12;			//ac
	float dirY;			//b0
	int current;        //b4
	float u23;			//b8
	float u24;			//bc
	float u25;			//c0
	void* u26;			//c4
	float u27;			//c8
	float u28;			//cc
	int reserved1;		//d0
	int u29; 			// Used - d4
	int analogX;		//d8
	int analogY;		//dc
	int reserved4;		//e0
	int reserved5;		//e4
	void* u30[18];
	ObjectData* objData; // 130
} __attribute__((packed)) MultiActor;

typedef struct {
	void* Type;			//0
	void* u2;
	int u3;
	int u4;	
	Vector position;	//10
	int u5;
	void* u6;			//20
	Vector scale;
	Vector direction;	//30
	void* u7;
	void* u8;			//40
	struct HitActor_t** colarray;
	uint16_t colcount;
	uint16_t colarraysize;
	int colsettings;
	float bound1;			//50
	float bound2;
	float bound3;
	float bound4;
	float bound5;			//60
	int colflags;
	int u18;
	int u19;
	void* u20;			//70
	void* u21;
	void* u22;
	int u23;
	int isFlipped;
	int flipTimer;
} __attribute__((packed)) flipBlockActor;

typedef struct{
	void* Type;
	void* u2;
	int u3;
	int hitCount;
	Vector position;
	int u5;
	void* u6;
	Vector scale;
	Vector direction;
	void* u7;
	void* u8;
	void* u9;
	int u10;
	int collision;
	float u12;
	float u13;
	float u14;
	float u15;
	float u16;
	int u17;
	int u18;
	int u19;
	void* u20;
} BlockActor;

typedef struct {
	void* Type;			//0
	void* u2;
	int u3;
	int u4;	
	Vector position;	//10
	int u5;
	void* u6;			//20
	Vector scale;
	Vector direction;	//30
	void* u7;
	void* u8;			//40
	struct HitActor_t** colarray;
	uint16_t colcount;
	uint16_t colarraysize;
	int colsettings;
	float bound1;			//50
	float bound2;
	float bound3;
	float bound4;
	float bound5;			//60
	int colflags;
	int u18;
	int u19;
	void* u20;			//70
	void* u21;
	void* u22;
	int u23;
	int isDown;
	int isRot;
} __attribute__((packed)) hexActor;

typedef struct{
	void* Type;					//0
	void* u2;					//4
	int u3;						//8
	int u4;						//c
	Vector position;			//10
	int u5;
	void* u6;					//20
	Vector scale;
	Vector direction;			//30
	void* u7;
	void* u8;					//40
	HitActor** colarray;
	uint16_t colcount;
	uint16_t colarraysize;
	int colsettings;
	float bound1;				//50
	float bound2;
	float bound3;
	float bound4;
	float bound5;				//60
	int colflags;
	int u18;
	int u19;
	void* u20;					//70
	int u21;
	int u22;
	uint32_t status;
	uint32_t laststatus;		//80
	int statustime;
	void* u23;					//88
	void* u24;					//8c
	void* u25;					//90
	uint16_t rotx;				//94
	uint16_t roty;				//96
	uint16_t rotz;				//98
	uint16_t roty2;				//9a
	void* u26;					//9c
	void* u27;					//a0
	Vector speed;				//a4
	void* u28[26];				//b0
	int flags;					//118
	void* u29[178];				//11c
	WaterGun* watergun;         //3e4
	void* u31;					//3e8
	void* u32;					//3ec
	struct Yoshi_t* yoshi;		//3f0
	void* u33[40];				//3f4
	MarioGamePad* gamepad; 		//4f4
} __attribute__((packed)) MarioActor;

typedef struct EnemyMario_t{
	void* Type;			//0
	void* u2;
	int u3;
	int u4;	
	Vector position;	//10
	int u5;
	void* u6;			//20
	Vector scale;
	Vector direction;	//30
	void* u7;
	void* u8;			//40
	HitActor** colarray;
	uint16_t colcount;
	uint16_t colarraysize;
	int colsettings;
	float bound1;			//50
	float bound2;
	float bound3;
	float bound4;
	float bound5;			//60
	int colflags;
	int u18;
	int u19;
	void* u20;			//70
	int u21;
	int u22;
	uint32_t status;
	uint32_t laststatus;//80
	int statustime;
	void* u23[36];		//88
	int flags;			//118
	void* u24[64];
	char name[16];		//218
	void* u25[180];		//228
	MarioGamePad* gamepad; //4fc
	void* u26[3940];
	uint16_t emarioflags;
	uint16_t emariodamage;	//4294
	uint16_t emariohealth;	//4296
	uint16_t u27;			//4298
	int u28;
	int u29;
	struct EMario_t* emario;
	int u30;
	int u31;
	float u32;
	float u33;
	uint16_t u34;
	uint16_t u35;
	uint16_t u36;
	uint16_t hpmetertimer;
} __attribute__((packed)) EnemyMario;

typedef struct EMario_t{
	void* Type;			//0
	void* u2;
	int u3;
	int u4;	
	Vector position;	//10
	int u5;
	void* u6;			//20
	Vector scale;
	Vector direction;	//30
	void* u7;
	void* u8;			//40
	HitActor** colarray;
	uint16_t colcount;
	uint16_t colarraysize;
	int colsettings;
	float bound1;			//50
	float bound2;
	float bound3;
	float bound4;
	float bound5;			//60
	int colflags;
	int u18;
	int u19;
	void* u20;			//70
	void* u21[55];
	EnemyMario* enemymario;
} __attribute__((packed)) EMario;

#define ITEMFLAG_STATIC 0x00000010

typedef struct{
	void* Type;
	void* u2;
	int u3;
	int u4;
	Vector position;
	int u5;
	void* u6;
	Vector scale;
	Vector direction;
	void* u7;
	void* u8;
	void* u9;
	int u10;
	int itemtype;
	float u12;
	float u13;
	float u14;
	float u15;
	float u16;
	int u17;
	int u18;
	int u19;
	void* u20;
	//0x74
	int pad1[14];
	Vector velocity;
	int pad2[14];
	int flags;
} __attribute__((packed)) ItemActor;

typedef struct{
	uint8_t u1;	//00
	uint8_t u2;
	uint8_t u3;
	uint8_t u4;
	int u5;		//04
	int u6;		//08
	int u7;		//0c
	MarioActor* mario;
} __attribute__((packed)) Yoshi;

typedef struct{
	void* u1[6];
	int count;			//18
	void* u1_2[21];
	Vector position;	//70
	void* u2[11];		//7c
	float u3;			//a8
	void* u4[4];		//7c
	float u5; 			//bc
	void* u6[4];		//c0
	float u7; 			//d0
	void* u8[9];		//d4
	float u9;			//f8
	void* u10[13];
	uint16_t u11;		//134
	uint16_t u12;
} __attribute__((packed)) WaterEmitInfo;

typedef struct {
 int u1;
 float u2;
} Sound;

typedef struct {
	int x1;
	int y1;
	int x2;
	int y2;
} JUTRect;
typedef struct {
	void* type;
	int content[64];
} J2DGrafContext;
typedef struct {
	void* type;
	int content[64];
} J2DOrthoGraph;
typedef struct {
	void* type;
	int content[9];
} J2DPrint;
typedef struct {
	void* type;
} JUTResFont;
typedef struct {
} ResFONT;
typedef struct {
	void* type;
	int pad1[2];
	int flags;
	JUTRect bounds;
	int content[100];
} J2DTextBox;
typedef struct {
	void* type;
	int content[64];
} J2DPaneO;
typedef struct {
	void* type;
	int content[64];
} J2DScreen;

typedef struct {
	int charIndex;
	int unk1;
	uint8_t voice;
} JMSMesgEntry;

typedef struct {
	int unk1;
	char* textBuf;
	JMSMesgEntry* entry[10];
} TalkMesEntry;

typedef struct {
	void* type;
	void* data[596];
	TalkMesEntry* msgEntry;
} Talk2D;

